
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_application_insights.appinsights


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights must be replaced
-/+ resource "azurerm_application_insights" "appinsights" {
      ~ app_id                                = "1d6c5efd-2178-4df6-8a92-11b0aef437ba" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.Insights/components/rpx-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "rpx-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rpx-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rpx-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      - timeouts {}
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat|rpx-aat"
        name                           = "rpx-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":47,"Program":"tfcmt","SHA1":"","Vars":{}} -->